''' 
Напишите программу, которая приветствует пользователя, выводя слово 
Hello, введенное имя и знаки препинания по образцу: Hello, Harry!
'''

b = str(input())
print("Hello," + " " + b + "!")