'''
Даны два целых числа. Выведите значение наименьшего из них.
'''

a = int(input())
b = int(input())
print(min(a, b))