'''
Дано натуральное число. Выведите его последнюю цифру.
'''

a = int(input())
b = str(a)
print(b[-1])