'''
Дано трехзначное число. Найдите сумму его цифр.
'''

n = int(input())
s = str(n)
b = int(s[0])
c = int(s[1])
d = int(s[2])
print(b + c + d)